% % построение нагрузочной характеристики
t = 0:0.1:100;
w = 2.5;
a = 1.75;
w_ = w / a;
J = 0.5;
M = 9;% was 6
k = 0.14; % гидродинамический коэф
a_t = a*sin(w_*t);
w_t = a*w_*cos(w_*t);
q_t = a*w_*w_*sin(w_*t);
Mn = 1.2*(-J.*q_t + k.*abs(w_t).*w_t + M);
plot(Mn, 10*w_t)
xlim([4 16])
ylim([-35 35])
xlabel("Момент, Нм", "FontSize", 14)
ylabel("Угловая скорость вращения, об/мин", "FontSize", 14)
grid on
hold on
% построение механической характеристики двигателя
u = 0.8;
i = 196;
m_ = 539;
m = 0:0.1:m_* i * u * 0.25;
n0 = 5900/i;
N_M = n0*(1 - m/(m_ * i * u));
plot(m/1000, N_M)

legend("Нагрузочна характеристика", "Механическая характеристика", "FontSize", 11)
