% % построение нагрузочной характеристики
t = 0:0.1:100;
w = 2;
w_ = 0.57;
a = 3.5;
% J = 0.21;
J = 1.3;
M = 6;
k = 0.1375;
a_t = a*sin(w_*t);
w_t = a*w_*cos(w_*t);
q_t = a*w_*w_*sin(w_*t);

Mn = -J.*q_t + k.*abs(w_t).*w_t + M;
% Mn = -J.*q_t + k.*w_t + M;
plot(Mn, 10*w_t)
xlabel("Момент, Нм")
ylabel("Угловая скорость вращения, об/мин")
hold on
% построение механической характеристики двигателя
i = 60;
m_ = 695;
m = 0:0.1:m_* i;
n0 = 1050/i;
% N_M = (n0 - m * 8.7);
N_M = n0*(1 - m/(m_ * i));
plot(m/1000, N_M)
grid on
